[
  {
    "title": "Milano Digital Front",
    "description": "An MVP website concept created for a new hardware and interiors store lacking an online presence. Developed after discovering this during a job interview, the project demonstrated initiative and was well received, even though the store ultimately chose to outsource their website.",
    "tech": [
      "React",
      "Tailwind CSS",
      "Framer Motion"
    ],
    "github": "https://github.com/ArunPandyanVasam/Milano",
    "demo": "https://milano-digital-front.netlify.app/",
    "image": "/assets/projects/milano-digital-front.jpg"
  },
  {
    "title": "Dynamic Surge Price",
    "description": "A dynamic surge pricing tool that calculates real-time order costs using live weather data. Users enter their location to view base price, weather surcharge, and final total. This app models real-world pricing strategies to enhance transparency and empower informed user decisions.",
    "tech": [
      "React",
      "Flask",
      "React Router"
    ],
    "github": "https://github.com/ArunPandyanVasam/dynamic-surge-pricing-frontend",
    "demo": "https://dynamic-surge-pricing.vercel.app/",
    "image": "/assets/projects/dynamic-surge-price.jpg"
  },
  {
    "title": "SoloTravel UI",
    "description": "SoloTravel UI is a sleek and modern user interface project designed to showcase a travel-themed webpage. It highlights destinations, experiences, and solo travel benefits using a clean React + Vite setup, perfect for design inspiration or front-end portfolio demonstration.",
    "tech": [
      "React",
      "Vite"
    ],
    "github": "https://github.com/ArunPandyanVasam/TravelApp-Frontend",
    "demo": "https://solotravel.netlify.app/",
    "image": "/assets/projects/solotravel-ui.jpg"
  },
  {
    "title": "ToDo",
    "description": "A simple and clean ToDo application built as part of my learning journey with Django. It allows users to add, edit, and delete tasks, helping me practice Python, Django routing, forms, and templating with HTML and CSS.",
    "tech": [
      "Python",
      "Django",
      "HTML",
      "CSS"
    ],
    "github": "https://github.com/ArunPandyanVasam/todo",
    "demo": "https://todo-lrpq.onrender.com/",
    "image": "/assets/projects/todo.jpg"
  },
  {
    "title": "Multiplication Game",
    "description": "An interactive multiplication game designed to help users improve math skills through fun, score-based challenges. It promotes quick thinking and accuracy within a clean, responsive, and user-friendly interface, offering an engaging and effective learning experience.",
    "tech": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "github": "https://github.com/ArunPandyanVasam/Multiplication-App",
    "demo": "https://gamemultiplication.netlify.app/",
    "image": "/assets/projects/multiplication-game.jpg"
  }
]